[
  {
    "id": "cb_broadband_scanners",
    "name": "BROADBAND SCANNERS™️",
    "source": "IC",
    "description": "Battlefield awareness is key and no one is more keenly aware of that fact than Intercorp™ Lancers. Having run into problems with adversaries utilising optical camouflage, some pilots have taken to upgrading their sensor suites with thermal, seismic, olfactory, infra-red, radar, sonar and even more means to locate an adversary. While this might seem excessive to outsiders, the results are hard to argue with.",
    "effect": "Whenever you apply Lock On to a target they also take 1 Heat. You may Lock On to targets that are Hidden. If you do, they immediately lose Hidden. When you consume Lock On on a target that is Invisible it loses Invisible for the duration of the attack."
  },
  {
    "id": "cb_adaptive_solutions",
    "name": "ADAPTIVE SOLUTIONS™️",
    "source": "IC",
    "description": "Adaptivity is one of Intercorp™'s core principles. By equipping a mech with specialised software Intercorp™ pilots are able to shore up their mechs weaknesses with relatively simple configurations, giving them a solid boost wherever it’s needed.",
    "effect": "Choose either Hull, Agility, Systems or Engineering. You gain +2 Accuracy to Saves and Checks with the chosen stat. You may choose a new stat when performing a Full Repair."
  },
  {
    "id": "cb_interblink",
    "name": "INTERBLINK™️",
    "source": "IC",
    "description": "Intercorp™'s greatest achievement and most jealously guarded secret is the Blinkdrive. \"Interblink™\" is a device that makes the need for Blink Gates obsolete. Installed on Interpoint Station, it enables the station to traverse light-years instantaneously. Downsized versions of the Interblink™ are sometimes awarded to trusted pilots who are sworn to absolute secrecy about its exact function.",
    "effect": "1/Round when you Boost you may instead Teleport up to your Speed. When you do you take Heat equal to your mech's Size + 1"
  },
  {
    "id": "cb_interclone",
    "name": "INTER-VAT CLONING SUITE™️",
    "source": "IC",
    "description": "Instead of growing bodies from scratch the Inter-Vat comes stock with mindless, unviable templates of adult human bodies. These templates are then simply surgically resculpted by the Vat's internals to make them resemble a desired person, while simultaneously imprinting them with a recorded subjectivity. The resulting clones don't share any genetic markers with the original and are often flawed.",
    "effect": "During a rest, if your mech is not destroyed and you or an allied pilot are dead you may immediately have an identical clone take their place. The returned character has to roll twice on the cloning quirks table.<br>Once per Full Repair you may deploy an exact copy of your pilot, equipment and all, adjacent to your mech as a Quick Action. They take their turn during your turn and are destroyed when down and out. The copy lasts until the end of the scene, at which point it disintegrates."
  },
  {
    "id": "cb_truestrike_stabilizers",
    "name": "TRUESTRIKE STABILIZERS™",
    "source": "IC",
    "effect": "Choose one mount. The final attack roll for weapons on this mount can never be affected by Difficulty or Accuracy.",
    "description": "Balance. Balance is achievable. Desirable even. With Truestrike Stabilizers, balance now becomes part of a Lancer's arsenal. While the exact mechanism of the stabilizers remains a secret, their efficacy can't be overstated. Using the Truestrike Stabilizers, every shot comes down to a pilot's inherent skill: nothing more, nothing less.",
    "mounted_effect": "The final attack roll of attacks made with weapons from this mount can never be affected by Difficulty or Accuracy."
  },
  {
    "id": "cb_farfield_exploration_suite",
    "name": "FARFIELD EXPLORATION SUITE™",
    "source": "IC",
    "description": "Surveying uncharted worlds is no easy task; terrain can be treacherous, radiation can be harsh, and those are just the more common hazards one can encounter. Intercorp™ since its inception, has been in the business of charting unknown worlds. The Farfield Exploration Suite is the culmination of the company's knowledge in environment mitigation. Be it hail, high water or the presence of an incredibly hazardous flesh eating bacteria, with the Farfield Exploration Suite you will always be prepared.",
    "effect": "You may ignore Difficult Terrain as well as the effects of Dangerous Terrain and all Environmental Effects. You gain Resistance to Burn as well as the effects of an EVA unit. You treat solid surfaces as flat ground for the purposes of movement and may move across them normally. If you do, you begin falling whenever you become Prone. "
  }
]