[
  {
    "id": "IC",
    "name": "INTERCORP™",
    "light": "#1AB316",
    "dark": "#1AB316",
    "description": "<p>Intercorp™ has its fingers in many pies, most of them legitimate, some of them of more dubious nature. Originally starting out as a space exploration and stellar cartography company, constantly on the look out for inhabitable planets and deep space mining opportunities, Intercorp™ has since risen to power by being a majority shareholder in many of the smaller companies founded on planets first discovered by them. While this makes Intercorp™ a vast and expansive corporation it also means that it is mostly decentralized, unable to bring its full power to bear on any focused goal.</p> <p>Despite that, or rather because of that fact, Intercorp™ has become one of the largest employers for mercenaries, hiring skilled individuals, soldiers of fortune and sometimes less prestigious characters for various agendas and odd-jobs all over the galaxy. Intercorp™ isn't following any particular overarching scheme with these actions, it is instead the myriad of Intercorp™ branches which are planning and conducting these operations of their own accord. While company officials won't state so publicly, Intercorp™ branches have even been known to clash in open hostilities when their agendas are at odds, hiring mercenary outfits to oppose each other in all out proxy wars over conflicting goals.</p> <p>The most famous asset at Intercorp™'s disposal is undoubtedly Interpoint Station, an excessively vast and advanced space station capable of utilizing Intercorp™'s so called \"Interblink™\" blinkdrive, an ominous device capable of shifting the entire station to any point within the known galaxy at a moment's notice. While nobody is entirely sure how Interpoint Station came to be, rumors have it that Intercorp™ stumbled upon it in its early years of space exploration, derelict and abandoned, seemingly constructed by an unknown party. While unproven, the theory is supported by the fact that the company doesn't actually seem to be able to replicate the technology that makes Interpoint so unique.</p> <p>Since its comissioning, Interpoint Station has quickly become a thorn in the side of many on the galactic stage. Popping up erratically at seemingly the most inorpportune times just to thwart somebody's plans, lay claim to some stake or to pursue some matter entirely unrelated. Despite that, retribution or fallout from most of these actions have yet to seriously affect either Intercorp™ or Interpoint, owing to the decentralized nature in the former's case and to the fact that escape is always just one blink jump away in the latter's.</p>",
    "quote": "<i>Intercorp™ hopes to be working with you again.</i>",
    "logo_url": "https://raw.githubusercontent.com/gist/foxcumberland/2e413e09ce303f84666a1eabdb200a69/raw/9f79559a63882b8a4922a38cb55d84c5b06153ee/IntercorpVector.svg"
  }
]