[
  {
    "id": "wm_swarm_beacon_rounds",
    "name": "SWARM BEACON ROUNDS",
    "sp": 1,
    "allowed_types": [
      "CQB",
      "Rifle",
      "Launcher",
      "Cannon",
      "Nexus"
    ],
    "source": "IC",
    "license": "ARGUS",
    "license_level": 2,
    "effect": "Choose one CQB, CANNON, LAUNCHER, NEXUS or RIFLE: 1/Round when you hit a character you may move a Drone you control up to 5 spaces directly toward them before you roll damage.",
    "description": "'Complex problems require simple solutions'. That is one of Intercorp™'s core principles. Historically, controlling a sizeable amount of drones simultaneously has been one of the greater challenges in designing frames. Despite most drones being able to operate semi autonomously they still require active input to feed them directions in combat scenarios. To reduce both pilot input and computing capacity taken up by \"babysitting\" drones during an active combat encounter, Intercorp™ scientists have devised Swarm Beacon Ammunition. <br>Following a relatively simple principle these specialised rounds \"tag\" any hostile struck by them with a potent marker that prompts nearby drones to flock to it on their own accord. This allows pilots to have their drones engage hostiles in a manner that doesn't require any active commands on their part, giving them the opportunity to concentrate on staying alive.",
    "data_type": "mod",
    "aptitude": {},
    "tags": [
      {
        "id": "tg_mod"
      },
      {
        "id": "tg_unique"
      }
    ]
  },
  {
    "id": "wm_jackpot_mod",
    "name": "JACKPOT MOD",
    "sp": 2,
    "allowed_types": [
      "Melee",
      "CQB",
      "Rifle",
      "Launcher",
      "Cannon",
      "Nexus"
    ],
    "source": "IC",
    "license": "CORONUS",
    "license_level": 2,
    "effect": "This system regains all charges upon resting. Whenever you attack with a weapon this mod is attached to, you may expend any amount of charges. If you do, the attack gains +1 Accuracy for each charge. If you spent any charges and the attack misses a target, destroy this System.",
    "description": "\"Daddy needs a new pair of Shoes.\" - Mantra of Jonathan \"Kell\" Kelly, professional sniper, deceased, uttered before his 100th confirmed mech kill.",
    "data_type": "mod",
    "aptitude": {},
    "tags": [
      {
        "id": "tg_mod"
      },
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": 3
      }
    ]
  },
  {
    "id": "wm_broken_blade_mod",
    "name": "BROKEN BLADE MOD",
    "sp": 1,
    "allowed_types": [
      "Melee"
    ],
    "source": "IC",
    "license": "ACASTUS",
    "license_level": 1,
    "effect": "Choose a non Auxiliary Melee weapon. While this weapon is destroyed you gain the Broken Blade. It is an Integrated Main Melee weapon with the following profile: Threat 1, 1d6 Energy, Armor-Piercing",
    "description": "Losing a melee weapon at an inopportune time can be devastating for Lancers who find themselves facing down an enemy in melee combat. By installing a so-called \"Broken Blade\" emitter to a weapon's hilt, the mech is able to create a temporary hard-light blade in a pinch. This allows for continued use of the weapon in the form of a deadly energy construct, even after its destruction.",
    "data_type": "mod",
    "aptitude": {},
    "tags": [
      {
        "id": "tg_mod"
      },
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_ap"
      }
    ],
    "restricted_sizes": [
      "Auxiliary"
    ]
  },
  {
    "id": "wm_underslung_attachment",
    "name": "UNDERSLUNG ATTACHMENT",
    "sp": 2,
    "allowed_types": [
      "Cannon",
      "Launcher",
      "CQB"
    ],
    "source": "IC",
    "license": "NESTOR",
    "license_level": 3,
    "effect": "This weapon gains Loading, loses Ordnance and can no longer attack normally. A weapon that has this mod applied must be linked to a different weapon on your mech. Whenever the linked weapon is used to Skirmish you may attack with this weapon as part of the same action after the linked weapon's attack is resolved. No other weapon attacks can be made in a turn in which this weapon was used to attack, before or after.",
    "description": "In a hostile engagement, it's hard to downplay the benefits of additional firepower. Combining multiple guns with each other creates a truly devastating weapon, capable of unleashing a single barrage that would be much harder to recreate with multiple weapons. <br>While the advantages of a secondary underslung weapon are clear, integrated ammo feeds become an issue, resulting in the need for manual reloads.",
    "data_type": "mod",
    "aptitude": {},
    "tags": [
      {
        "id": "tg_mod"
      },
      {
        "id": "tg_unique"
      }
    ],
    "restricted_sizes": [
      "Heavy",
      "Superheavy"
    ]
  },
  {
    "id": "wm_weaponsmith_mod_1",
    "name": "WEAPONSMITH MOD RANK 1",
    "sp": 1,
    "allowed_types": [
      "CQB",
      "Rifle",
      "Launcher",
      "Cannon",
      "Nexus",
      "Melee"
    ],
    "source": "",
    "license": "EXOTIC",
    "license_level": 0,
    "effect": "Gain a Rank 1 Weaponsmith Bonus, you can add them via exotic Equipment.",
    "description": "Baseline Modification.",
    "data_type": "mod",
    "aptitude": {},
    "tags": [
      {
        "id": "tg_mod"
      },
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_exotic"
      }
    ]
  },
  {
    "id": "wm_weaponsmith_mod_2",
    "name": "WEAPONSMITH MOD RANK 2",
    "sp": 2,
    "allowed_types": [
      "CQB",
      "Rifle",
      "Launcher",
      "Cannon",
      "Nexus",
      "Melee"
    ],
    "source": "",
    "license": "EXOTIC",
    "license_level": 0,
    "effect": "Gain a Rank 1 and Rank 2 Weaponsmith Bonus, you can add them via exotic Equipment.",
    "description": "Expert Calibration",
    "data_type": "mod",
    "aptitude": {},
    "tags": [
      {
        "id": "tg_mod"
      },
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_exotic"
      }
    ]
  },
  {
    "id": "wm_weaponsmith_mod_3",
    "name": "WEAPONSMITH MOD RANK 3",
    "sp": 3,
    "allowed_types": [
      "CQB",
      "Rifle",
      "Launcher",
      "Cannon",
      "Nexus",
      "Melee"
    ],
    "source": "",
    "license": "EXOTIC",
    "license_level": 0,
    "effect": "Gain a Rank 1, Rank 2 and Rank 3 Weaponsmith Bonus, you can add them via exotic Equipment.",
    "description": "Smartcore Integration",
    "data_type": "mod",
    "aptitude": {},
    "tags": [
      {
        "id": "tg_mod"
      },
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_exotic"
      }
    ]
  }
]