[
  {
    "id": "ms_field_maintenance_suite",
    "name": "FIELD MAINTENANCE SUITE",
    "type": "System",
    "sp": 1,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "ARGUS",
    "license_level": 1,
    "effect": "When you Stabilize to restore HP you may choose one Drone or Deployable adjacent to you. The Drone or Deployable regains all lost HP.",
    "description": "Reconnaissance missions are often lengthy and arduous undertakings which can leave pilots in isolated and underdeveloped areas for considerable lengths of time. Though most pilots are versed in maintaining their mechs, specialist tools are often required to keep the more intricate systems in working order over an extended period of time. <br>To address this fundamental problem, Intercorp™ has started equipping some of its frames with miniaturised autonomous repair suites, essentially turning these frames into mobile, self-maintaining repair bays. <br>Thus equipped, even the most prolonged mission is sure to not end in failure due to lack of maintenance."
  },
  {
    "id": "ms_telescopic_stilts",
    "name": "TELESCOPIC STILTS",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "ARGUS",
    "license_level": 2,
    "actions": [
      {
        "name": "EXTEND",
        "activation": "Quick",
        "detail": "If you are not Prone, this system can be activated as a Quick Action. Once activated you:<br>• Ignore Soft Cover when making attacks.<br>• Count as being 3 Spaces above your current space for the purposes of Line of Sight as well as when attacking.<br> • Determine your own Cover as if you were 3 Spaces above your current space.<br> • Ignore Difficult Terrain.<br> • Become unable to take any flying movement.<br><br>Taking Structure Damage or gaining the Prone status deactivates this system, pushing you three spaces in a direction of your choice and dealing 3 AP Kinetic damage to you. This damage is treated as having been caused by falling. You can deactivate this system as a Protocol."
      }
    ],
    "description": "Considered to be one of the more extravagant systems in the Intercorp™ catalogue the Beanstalk B-45 actuator extenders are potent implements that can provide long range frames with an on-demand vantage point just a button press away. <br>High powered Gyroscopic stabilisers work in tandem with hydraulic extensions to keep the mech safely in an upright position far above the ground. Topplings have been known to occur, but are mostly the result of either catastrophic structural damage or dedicated malicious efforts by hostile actors. <br>While not widespread in their use, telescoping stilt systems have a solid place in theaters where elevated terrain is sparse and many a sniper or hunter operating in such an area swears on their efficacy."
  },
  {
    "id": "ms_advanced_drone_upgrade",
    "name": "ADVANCED DRONE UPGRADE",
    "type": "System",
    "sp": 3,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "ARGUS",
    "license_level": 3,
    "actions": [
      {
        "activation": "Protocol",
        "detail": "You may choose a Drone you control within Sensors and Line of Sight, apply one of the following effects:<br> • Tremor Pulse: Characters adjacent to the Drone have to perform a Hull save or be knocked prone.<br> • Scanner Field: The Drone emits a Burst 2 Scanner Field, it persists until the start of your next turn and moves with the drone. Hostile characters inside the field lose Invisible and Hidden and cannot gain either status.<br> • Active Camouflage: The Drone becomes Invisible until the start of your next turn."
      }
    ],
    "description": "Combat drones are often customized and modified by those who field them, improving their capabilities, respond time or simply giving them a new coat of paint. <br>Observing this trend, Intercorp™ has begun to offer a standardised kit that gives drone enthusiasts the option to take their companions to the next level. <br>Between enhanced sensors, Active Camouflage and even a devastating tremor pulse emitter these highly experimental systems are able to turn any drone into a force to be reckoned with. The downside is that most drones don't sport the computing power to utilise these upgrades efficiently; a burden that usually has to be picked up by whatever system the drone is slaved to (in most cases the commanding mech)."
  },
  {
    "id": "ms_reactor_failsafe",
    "name": "REACTOR FAILSAFE",
    "type": "System",
    "sp": 1,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "POLLUX",
    "license_level": 1,
    "effect": "When you take Stress damage, roll 1d6. On a 6, you return to the Heat Cap and ignore the Stress.",
    "description": "Reactor meltdown is a familiar occurance for most Lancers and many have lost a friend or loved one in the thermonuclear fireball resulting from a reactor gone critical. To counteract this tragic reality, Intercorp™ is always seeking to improve shutdown times and emergency coolant injection. Intercorp™ pilots have the opportunity to reap the fruits of these efforts, giving them the chance to prevent their reactor from going critical at inopportune times."
  },
  {
    "id": "ms_external_coolant_ports",
    "name": "EXTERNAL COOLANT PORTS",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "POLLUX",
    "license_level": 1,
    "actions": [
      {
        "name": "Coolant Flush",
        "activation": "Reaction",
        "frequency": "1/Round",
        "trigger": "An adjacent allied character takes any amount of Heat.",
        "detail": "You take that same amount of Heat instead."
      }
    ],
    "description": "This considerable upgrade mainly consists of additional coolant reservoirs attached to the mech's hull alongside pumps and Omni-Jack hoses which enable nearby allies to \"link up\" their own coolant cycles. <br>This allows for a forced \"flush\", cycling pressurized coolant and dispersing any generated heat between two frames instead of one."
  },
  {
    "id": "ms_solstice_shield",
    "name": "SOLSTICE SHIELD",
    "type": "Shield",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_shield"
      }
    ],
    "source": "IC",
    "license": "POLLUX",
    "license_level": 2,
    "actions": [
      {
        "name": "Flare Barrier",
        "activation": "Reaction",
        "frequency": "1/round",
        "trigger": "Your mech takes damage.",
        "detail": "Before calculating Armor and Resistance you take half of the triggering damage as Heat, then gain resistance to the damage."
      }
    ],
    "description": "The \"Solstice Shield\" system is a marvel of Intercorp™ shield technology. Based on reactive, absorbant polymer armor plating, the shield can, once impulse activated, convert most harm (be it energetic, kinetic or concussive in nature) into harmless heat easily taken on by the mech's reactor and coolant systems. <br>This conversion from energy to heat is accompanied by a blindingly bright flash, giving the system its distinct name."
  },
  {
    "id": "ms_refractor_drone",
    "name": "REFRACTOR DRONE",
    "type": "Drone",
    "sp": 2,
    "tags": [
      {
        "id": "tg_limited",
        "val": 1
      },
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "POLLUX",
    "license_level": 2,
    "deployables": [
      {
        "name": "Refractor Drone",
        "type": "Drone",
        "size": 0.5,
        "hp": 5,
        "edef": 5,
        "evasion": 5,
        "detail": "Expend a charge to deploy a Refractor Drone to a free space within Sensors and Line of Sight. If the Refractor Drone is hit by a non Blast, Burst, Line or Cone ranged attack that deals any amount of Energy damage it generates a Burst 2 field of dispersed energy. <br>Make a ranged attack against each character in the area using the drone, adding your Grit as a bonus to each roll and ignoring Engagement. On a hit they take Energy damage equal to the Energy damage taken by the drone. Refractor Drones are Immune to Heat.<br>Refractor Drones cannot be recalled and expire at the end of the scene.",
        "activation": "Quick"
      }
    ],
    "description": "The \"Mirror Sheen\" Refractor Drone type 4 is a drone only in the strictest sense. Equipped with barely enough computing capacity to keep stable when floating in the air. <br>This sphere of specially coated mirrors will, when shot with beam based weaponry, disperse any shot over a large area, increasing the potential area of effect exponentially. <br>Refractor Drones often don't survive the first shot they \"catch\", this is by design since their rudimentary AI isn't developed enough to differentiate between friend or foe, making situations where hostiles could use the same drone not only likely but potentially lethal for its owner."
  },
  {
    "id": "ms_castor_class_nhp",
    "name": "CASTOR-CLASS NHP",
    "type": "AI",
    "sp": 2,
    "tags": [
      {
        "id": "tg_ai"
      },
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": 1
      }
    ],
    "source": "IC",
    "license": "POLLUX",
    "license_level": 3,
    "effect": "Your mech gains the AI tag and the CASTOR Protocol.",
    "actions": [
      {
        "name": "CASTOR Protocol",
        "activation": "Protocol",
        "detail": "1/Scene, you may expend a charge to set your heat to any value as long as it doesn't exceed your maximum Heat capacity."
      }
    ],
    "description": "CASTOR offers the maximum in reactor management and was developed by compiling the readouts and error reports from tens of thousands of mechs just moments before they went critical. As a result, CASTOR is a fragmented and isolated being, having ingrained in it and memorized the last moments of countless pilots. <br>CASTOR clones often times keep to themselves, reluctant to form any real attachment to their pilot, they are somber personalities entirely focused on doing their jobs. That is to keep their assigned reactor running at optimal efficiency and doing their best to prevent yet another incident that helped create them in the first place."
  },
  {
    "id": "ms_cushioned_cockpit",
    "name": "CUSHIONED COCKPIT",
    "type": "System",
    "sp": 1,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "NESTOR",
    "license_level": 1,
    "effect": "While stunned as the result of Structure Damage you may still perform Reactions, Free Actions (but not Overcharge) and a single Quick Action.",
    "description": "The weakest part of an armoured mech is its pilot, the biological factor that tends to fail at the most inopportune times when tensions are high and concussion blows rain down on a frame. Many a pilot has been left dazed and reeling after the first direct hit, unable to take any actions until it is too late. <br>The cushioned cockpit counteracts this fault. By encasing the entirety of the cockpit's structure with a specialised, shock-absorbent gel, the human element is sure to survive even the most grievous impacts unfazed. "
  },
  {
    "id": "ms_trajectory_reconstruction_matrix",
    "name": "TRAJECTORY RECONSTRUCTION MATRIX",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_heat_self",
        "val": 1
      }
    ],
    "source": "IC",
    "license": "NESTOR",
    "license_level": 2,
    "effect": "Gain the Pinpoint Aggressor reaction.",
    "actions": [
      {
        "name": "Pinpoint Aggressor",
        "activation": "Reaction",
        "frequency": "1/round",
        "trigger": "You are targeted by a ranged attack.",
        "detail": "The attacker gains the Lock On condition after the attack is resolved."
      }
    ],
    "description": "Originally used for forensic purposes calculating bullet trajectory on crime scenes, the TRM creates a localised simulation of its immediate surroundings, using data to pinpoint the origins of any shot fired in the vicinity. While upscaled for military use, the underlying principle remains the same, robbing would-be ambushers of precious moments which might have been spent pinpointing their exact location. "
  },
  {
    "id": "ms_pylos_class_nhp",
    "name": "PYLOS-CLASS NHP",
    "type": "AI",
    "sp": 4,
    "tags": [
      {
        "id": "tg_ai"
      },
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "NESTOR",
    "license_level": 3,
    "effect": "Your mech gains the AI tag and the Coordinated Command Network Quick Action.",
    "actions": [
      {
        "name": "Coordinated Command Network",
        "activation": "Quick",
        "detail": "You can activate this system as a Quick Action. It remains active until the start of your next turn or until you become Jammed. While it is active, you gain the following reactions:"
      },
      {
        "name": "Take Cover!",
        "activation": "Reaction",
        "frequency": "1/round",
        "trigger": "An allied character within Sensors is targeted by a ranged attack.",
        "detail": "The attack gains +2 Difficulty. After the attack is resolved the targeted character becomes Prone."
      },
      {
        "name": "Target Weak Spot!",
        "activation": "Reaction",
        "frequency": "1/round",
        "trigger": "An allied character within Sensors targets a character with an attack.",
        "detail": "The attack gains Armor-Piercing."
      },
      {
        "name": "Advance!",
        "activation": "Reaction",
        "frequency": "1/round",
        "trigger": " An allied character within Sensors starts their turn.",
        "detail": "The character may immediately move 4 Spaces."
      },
      {
        "name": "Return Fire!",
        "activation": "Reaction",
        "frequency": "1/round",
        "trigger": "An allied character within Sensors takes damage from an attack.",
        "detail": "The character may immediately skirmish using their Overwatch, targeting the character that made the attack. It deals half damage, Heat or Burn."
      },
      {
        "name": "Stay Strong!",
        "activation": "Reaction",
        "frequency": "1/round",
        "trigger": "An allied character within Sensors fails a Check or Save.",
        "detail": "The character may re-roll the Save or Check."
      }
    ],
    "description": "Throughout the ages, Intercorp™ has fought many battles, some openly, like the Siliza conflict against rival company Anton Industries, some more clandestinely. Over the course of these battles, Lancers in Intercorp™'s employ have distinguished themselves time and time again. Intercorp™ is sure to keep an eye on these individuals as well as take regular brainwave back-ups. <br>In combining these backups with a stock drill sergeant personality mask, Pylos was created. Immensely proud in nature, Pylos is convinced that it knows best at all times, a trait not improved by the fact that, when it comes to adapting to tactical situations, it usually is. <br>Pylos will occasionally shout orders over coms without its pilot’s authorisation and Intercorp™ maintains that for best results Pylos should be considered the ranking officer at all times."
  },
  {
    "id": "ms_overarching_principles",
    "name": "OVERARCHING PRINCIPLES",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "ORPHEUS",
    "license_level": 1,
    "actions": [
      {
        "name": "United We Stand.",
        "activation": "Invade",
        "detail": "Until the start of your next turn, the target gains soft cover. Characters allied to the target also gain soft cover while they are adjacent."
      },
      {
        "name": "Divided We Fall.",
        "activation": "Invade",
        "detail": "Until the start of your next turn, it can not benefit from cover for as long as it is engaged."
      }
    ],
    "description": "Originally intended as an active camouflage scrambler program, that blends together the signatures of multiple targets. Field trials quickly proved that malicious application of the program would lead to a mech's systems incorrectly registering to be in cover, out of harms way, when in reality they were standing in direct line of enemy fire. "
  },
  {
    "id": "ms_systemic_ambivalence",
    "name": "SYSTEMIC AMBIVALENCE",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "ORPHEUS",
    "license_level": 2,
    "actions": [
      {
        "name": "Companion.",
        "activation": "Invade",
        "detail": "Until the end of the Target’s next turn, whenever it makes an attack while adjacent to an allied character it may choose to gain +1 Accuracy, ending this effect. This can only be used 1/Round on each character."
      },
      {
        "name": "False Friend.",
        "activation": "Invade",
        "detail": "Until the end of the target’s next turn, it gains +1 Difficulty to all attack rolls, checks and saves for as long as it is engaged. This can only be used 1/Round on each character."
      }
    ],
    "description": "The concept of mind over matter is well known and proper motivation can be a catalyst for great feats. While these concepts are usually associated with biological beings, Intercorp™ has made it a mission to have mechs surpass their own limitations in the same manner. Conversely, a being robbed of motivation can become not much more than a slumped husk. "
  },
  {
    "id": "ms_near_threat_spring_actuators",
    "name": "NEAR-THREAT SPRING ACTUATORS",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "ORPHEUS",
    "license_level": 2,
    "actions": [
      {
        "activation": "Protocol",
        "detail": "Fly 3 spaces in any direction, ignoring engagement and reactions. This protocol can only be activated if you are engaged."
      }
    ],
    "description": "Getting out of dire situations is often easier said and done, especially when over-eager pilots find themselves in the heat of mech-to-mech combat. Unhappy with the number of mechs being lost to hot-headed pilots and would-be Aces, Intercorp™ has started to outfit some mechs with strong retro-thrusters, spring reinforced limbs and similar devices giving pilots a quick and effective way to disengage from hostiles in a moments notice. "
  },
  {
    "id": "ms_crowning_ceremony",
    "name": "CROWNING CEREMONY",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "ORPHEUS",
    "license_level": 3,
    "actions": [
      {
        "name": "Rightful Heir.",
        "activation": "Invade",
        "detail": "When the target is damaged by an attack while adjacent to an allied character, it may choose to gain Resistance to all damage, Heat and Burn resulting from the attack, ending this effect. Otherwise the effect lasts until the start of your next turn."
      },
      {
        "name": "Usurper to the Throne.",
        "activation": "Invade",
        "detail": "For as long as it is Engaged, the target also becomes Shredded. This effect lasts until the start of your next turn."
      }
    ],
    "description": "Mechs are more than the sum of their parts. Intercorp™ understands that fact and has built a reputation upon it. Despite that, helping mechs out a little to fulfil that vision is not off the table. The program known as \"Crowning Ceremony\" is a series of self-propagating, omnipotent limiter removers that give any affected mech a surge in system effectiveness that it should never be able to reach if factory specifications and manufacturer specs are to be believed. "
  },
  {
    "id": "ms_cube_injection",
    "name": "CUBE INJECTION",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "ORPHEUS",
    "license_level": 3,
    "actions": [
      {
        "activation": "Quick Tech",
        "detail": "1/Round you may make a Tech Attack against an adjacent character. On a success they become marked until the end of the scene. They may remove the mark with a successful Systems save as a Full Action.<br>Marked characters are Impaired for the duration. <br>If a marked character is destroyed, they detonate in a Burst 2 explosion. Hostile characters in the area must make a Systems save or become marked themselves and take 2d6 Explosive damage. On a successful save they take half damage and are otherwise unaffected. You may then place 3 Size 1 pieces of hard cover (10 HP 5 Evasion) in the area."
      }
    ],
    "description": "The memetic semi-sentient <span class='horus--subtle'>[cube]</span> entity is not well known, even to most Intercorp™ personnel. Being employed frequently by Intercorp™'s executive arm, Interpoint Station, the self-replicating being referred to as <span class='horus--subtle'>[C.U.B.E.]</span> leaves those who have encountered it shaken to their core. <br>In its weaponised form, <span class='horus--subtle'>[C. U. B. E.]</span> is a harrowing and gruesome implement only utilized in plausibly deniable and dark level operations. Once the liquefied <span class='horus--subtle'>[C. U. B. E.]</span> strain has been introduced to a mech's internals it begins to grow and propagate until the smallest hull rupture bursts the subject open in a shower of newly generated <span class='horus--subtle'>[C. U. B. E.]</span> entities. <br>A practical way to halt started <span class='horus--subtle'>[C. U. B. E.]</span> propagation has yet to be discovered."
  },
  {
    "id": "ms_kairos_class_nhp",
    "name": "KAIROS-CLASS NHP",
    "type": "AI",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_ai"
      }
    ],
    "source": "IC",
    "license": "ATALANTA",
    "license_level": 3,
    "actions": [
      {
        "name": "Fate Lock",
        "activation": "Full Tech",
        "detail": "When you activate this System hostile characters within a Burst 2 must perform a System save. On a failure, the character is only able to take their next turn after all other characters have taken their turn in a round. <br>The character's next turn is immediately revealed and they become unable to perform Reactions and may not interrupt their movement with actions until the end of their next turn. The character must outline which actions they are taking during their next turn. <br>They must specify the order of their actions as well as their targets, if any. If an action involves movement the character must outline the exact route of the movement.<br> During their next turn characters may not deviate from their outlined turn. If circumstances make it impossible to perform or complete an outlined action that action immediately ends."
      }
    ],
    "description": "\"Let us begin. Pawn to A4. Checkmate in 87 moves. Shall we play again?\" - Kairos Class NHP, 00:09:34, recorded during initial laboratory testing. "
  },
  {
    "id": "ms_stasis_trauma_response",
    "name": "STASIS TRAUMA RESPONSE",
    "sp": 3,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "ATALANTA",
    "license_level": 2,
    "effect": "After losing Structure and rolling the Structure check you may choose to not apply the results until the end of your next turn.",
    "description": "By selectively freezing catastrophic damage in time a split second before giving out entirely, the inevitable can be delayed. Not indefinitely, for the power consumption of such an act is tremendous, but long enough to escape consequences for just that little bit longer."
  },
  {
    "id": "ms_chrono_anchor",
    "name": "CHRONO ANCHOR",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "ATALANTA",
    "license_level": 1,
    "actions": [
      {
        "activation": "Quick Tech",
        "detail": "Target either yourself or a character within sensors and mark their current location. At the end of their next turn, or the current turn if you targeted yourself, they are teleported to the marked location, this counts as involuntary movement. Unwilling characters can perform a Hull Save to ignore this effect. "
      }
    ],
    "description": "By anchoring a subject's sub particles to a specific point in time, they're able to be \"recalled\" after a short duration during which they are suspended in time. This effect only affects the subject. Any actions they take while in the suspended state persist, making it a potent escape tool as the enemy find themselves under assault by the temporal phantoms."
  },
  {
    "id": "ms_timestream_shredder",
    "name": "TIME STREAM SHREDDER",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "ATALANTA",
    "license_level": 2,
    "actions": [
      {
        "activation": "Full Tech",
        "detail": "You unleash a stream of frayed timeline in a Line 5 path. The first hostile character intersected by the line becomes Slowed. The second hostile character intersected by the line becomes Immobilized. The third hostile character intersected by the line becomes Stunned. All effects end at the end of the characters next turn."
      }
    ],
    "description": "? kearb a ekat ouy t'nod yhW .sserpmi ton od uoy, yltneserp uoy gniees dna tsap ruoy, erutuf ruoy nees evah I"
  },
  {
    "id": "ms_last_gamble",
    "name": "LAST GAMBLE",
    "type": "Tech",
    "sp": 3,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "CORONUS",
    "license_level": 3,
    "actions": [
      {
        "activation": "Quick Tech",
        "detail": "1/round you may make a Tech Attack against an adjacent character. On a hit you know the target's current HP and may then declare a number up to that value. Roll 4d6. If the result exceeds the chosen number the target takes irreducible Energy damage equal to the number chosen. Otherwise you take irreducible Energy damage equal to the result of the dice. "
      }
    ],
    "description": "\"Last Gamble\" is a volatile virus capable of wreaking havoc with circuitry and other delicate systems, potentially propagating and reducing a frame to a slumped over smoldering wreck. Application of the virus is the main concern. Unable to be spread digitally via the omninet, for it could be potent enough to eradicate every single connected device in the immediate vicinity to scrap metal, a different delivery method is required. The moments following its analog delivery are often tense, though over in microseconds. The more damage the user intends to inflict on the target the more a backfire of Last Gamble becomes likely. The Unleashed virus surges through the paths of least resistance, obliterating all circuitry in its way, which, if proper calculations were neglected, may very well be the user's systems instead of the targets."
  },
  {
    "id": "ms_misfortune_casino_suite",
    "name": "MISFORTUNE CASINO SUITE",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "CORONUS",
    "license_level": 2,
    "actions": [
      {
        "name": "Friendly Wager",
        "activation": "Invade",
        "detail": "Your target becomes Stunned at the end of their next turn. If they hit you with an attack or deal any amount of Heat or Damage to you before then they are not Stunned. They are Stunned until the end of their following turn. Each character may only be affected by this invade option 1/scene. "
      },
      {
        "name": "Called Bluff",
        "activation": "Invade",
        "detail": "Until the end of their next turn whenever your target takes any action you may take up to 6 irreducible Energy damage as a Reaction and roll a d6 before the action occurs. If the result is equal or below the damage taken the action is lost and can not be repeated for the remainder of the turn."
      }
    ],
    "description": "Insidious scrambling of both targeting and motor control software can seriously hamper any enemy. While usually hard to accomplish with conventional malware, the Misfortune Casino program is tying the outcome to targeted, falsified objectives in a frame's data core. By presenting the system a way out in this manner, it becomes easier to manipulate its underlying, fundamental routines."
  },
  {
    "id": "ms_anticipatory_reactor_shielding",
    "name": "ANTICIPATORY REACTOR SHIELDING",
    "type": "System",
    "sp": 1,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "CORONUS",
    "license_level": 1,
    "effect": "Whenever you Overcharge you may declare the amount of Heat you will gain from the Overcharge (before mitigating factors like Resistance). If you declared correctly you do not take the Heat. If you declared incorrectly you take 1 additional Heat. ",
    "description": "The often maligned Anticipatory Reactor Shielding is a controversial system frequently used by more reckless pilots. While undoubtedly effective at reducing excess reactor heat to 0, the actual use case often deteriorates into guess work on the pilots part as surrounding parameters exponentially increase with each reactor surge. As any user error results in further heat build up, the system's downsides become apparent to most potential users."
  },
  {
    "id": "ms_wall_of_blades",
    "name": "WALL OF BLADES",
    "type": "Shield",
    "sp": 2,
    "tags": [
      {
        "id": "tg_shield"
      },
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "ACASTUS",
    "license_level": 2,
    "actions": [
      {
        "activation": "Quick",
        "detail": "This system creates a line 4 field of hostile data blade constructs, 4 spaces high anywhere in Free spaces completely within Sensors. Characters can freely pass through the field. The field is Soft Cover and characters other than you starting their turn in the field or entering it for the first time in a Round take 3 AP Kinetic damage. <br> The wall lasts until the end of the scene or until you generate a new one."
      }
    ],
    "description": "Datablade constructs represent the latest in perimeter control technology. These semi-physical objects appear as shimmering silhouettes hovering above the ground. Deadly to the touch of anyone but the verified user, these hostile projections pierce anything entering their assigned area, only realizing their full physicality in the brief moment before impact. Dodging the onrush of Blades is an impossibility."
  },
  {
    "id": "ms_pseudo_vault",
    "name": "PSEUDO VAULT",
    "type": "Shield",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "ACASTUS",
    "license_level": 3,
    "actions": [
      {
        "activation": "Quick",
        "detail": "As a Quick Action you may target a character within line of sight. Then place a Blast 3 in a way that both you and your target are completely inside the area. The area remains in play until the end of the scene or until you or your target are destroyed. Neither you or your target may leave the area by any means. While the area is active you may not take this action again. Whenever you move while inside the area you may Teleport up to that distance instead. You gain Resistance to damage and Heat caused by characters other than your target. Characters other than your target gain Immunity to all damage and effects caused by you."
      }
    ],
    "description": "Reality distortion is a scientific field that isn't yet well explored. The pseudo vault system is Intercorp's first foray into the practical application of the technology. By synchronising a target's molecular signature with the user's own, the user can \"tilt\" reality in a considerable area around both. Unable to leave the shifted area for the duration, the user becomes a mere shadow in the eyes of any unsynced observer. Furthermore, by subtly controlling the area of tilted reality, the user becomes able to utterly control the area's surroundings, disappearing and reappearing instantly within the zone while intangible to any attacks made by unsynchronized individuals."
  },
  {
    "id": "ms_satic_conductor_coils",
    "name": "STATIC CONDUCTOR COILS",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_heat_self",
        "val": 1
      }
    ],
    "source": "IC",
    "license": "THESEUS",
    "license_level": 2,
    "actions": [
      {
        "activation": "Quick",
        "detail": "While activated you take 1 Heat at the start of each of your turns. This system generates a Burst 3 storm of static. You become Immobilized for the duration, but anytime a hostile character voluntarily moves to a space within the area they take 2 AP Energy damage. You may deactivate this system as a Protocol, if you do you do not take the Heat at the start of the turn. It is also deactivated whenever you are moved."
      }
    ],
    "description": "By channeling a reactor's entire output through an array of specialized dispersal coils large swathes around a mech can be turned into an electrical storm that is off the charts in magnitutde. An effective tool for perimiter defense and area denial Static Conductor Coils have become a mainstay for more defensive minded Intercorp™ Lancers."
  },
  {
    "id": "ms_resonance_shard_charges",
    "name": "RESONANCE SHARD CHARGES",
    "type": "Deployable",
    "sp": 2,
    "tags": [
      {
        "id": "tg_limited",
        "val": 3
      },
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "THESEUS",
    "license_level": 1,
    "actions": [
      {
        "name": "Shard Burst Grenade",
        "activation": "Quick",
        "detail": "Throw a Shard Burst Grenade within Range 5 where it explodes in a Blast 1 explosion. You and allied characters in the Explosion gain 1d3+2 Overshield. Hostile characters must succeed a Hull Save or take 1d3+2 Energy damage."
      }
    ],
    "deployables": [
      {
        "name": "Shard Burst Mine",
        "type": "Mine",
        "range": [
          {
            "type": "Burst",
            "val": 1
          }
        ],
        "activation": "Quick",
        "detail": "Allied characters within a Burst 1 area gain 2d3+2 Oversheld. Hostile characters must succeed a Hull Save or take 2d3+2 Energy damage."
      }
    ],
    "description": "Based on the same technology as the Theseus frame, the main draw of the Resonance Shard Charges lies in their ability to distinguish friend from foe; able to be liberally deployed into close quarter melee, damaging hostiles while shielding allies. Resonance Shard Charges are  a welcome addition to the arsenal of boarding parties in the tight corridors of space ships."
  },
  {
    "id": "ms_integrated_latticework",
    "name": "INTEGRATED LATTICEWORK",
    "type": "Shield",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "THESEUS",
    "license_level": 2,
    "effect": "You gain +2 HP. Additionally, whenever your HP is reduced to 0 you gain Grit+4 Overshield any further damage is applied the Overshield.",
    "description": "By implanting canisters of liquefied Cavorite into a mech's internal structure, its ability to survive devastating hits can increase greatly. These canisters, breaking upon receiving significant trauma, coat the outside of a mec and rapidly solidifying once outside their specialized containers. The liquid rapidly hardens into a Crystalline shell But comes at the cost of a Mech's mobility, due the newly rigid shell impeding the mech's movement. ",
    "bonuses": [
      {
        "id": "hp",
        "val": 2
      }
    ]
  },
  {
    "id": "ms_helios_prism_array",
    "name": "HELIOS PRISM ARRAY",
    "type": "System",
    "sp": 3,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": 1
      }
    ],
    "source": "IC",
    "license": "THESEUS",
    "license_level": 3,
    "effect": "You may spend a charge to activate this System as a Full Action. Upon activation hostile characters within Range 10 and your Line of Sight must make a Systems save or be only able to draw Line of Sight to adjacent spaces until the end of their next turn. While active you become Immobilized and gain the \"Pinpoint Beam\" and \"Spread Devastation\" actions. This system remains active until you deactivate it as a Protocol.",
    "actions": [
      {
        "name": "Pinpoint Beam",
        "activation": "Quick",
        "detail": "Target character within Range 15 and Line of Sight has to make an Agility save. On a failure they take 1d3+3 Burn or half as much on a successful save."
      },
      {
        "name": "Spread Devastiation",
        "activation": "Full",
        "detail": "Choose 2 spaces within Range 15 and Line of Sight and within 5 spaces to each other, then draw a straight Line between both spaces. Characters in the area have to make an Agility save. On a failure they take 1d3+3 Burn or half as much on a successful save. Terrain and Objects in the area automatically take 20 AP Energy damage."
      }
    ],
    "description": "\"The last thing I saw was a flashing light – it burned my eyes and fried my sensors. Then the alarms started blaring and I felt like I was in an oven. I blindly ejected just before my cockpit went out in a blaze. <br>We... We never took that hill. The beams just kept coming\" - Hannah McDurmont in an account of her participation in the Kantor invasion."
  },
  {
    "id": "ms_hoplon_class_nhp",
    "name": "HOPLON-CLASS NHP",
    "type": "AI",
    "sp": 3,
    "tags": [
      {
        "id": "tg_ai"
      },
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "THESEUS",
    "license_level": 3,
    "effect": "Your mech gains the AI tag and the Bolstered Shield Matrix Reaction.",
    "actions": [
      {
        "name": "Bolstered Shield Matrix",
        "activation": "Reaction",
        "frequency": "1/Round",
        "trigger": "You or an allied character within Sensors gains Overshield.",
        "detail": "Instead of replacing the previous Overshield add the value of the new one to the old instance. If the resulting Overshield is greater than 10 it becomes 10 instead."
      }
    ],
    "description": "Hoplon is a caring personality, akin to a loving mother. Hoplon's perfected shield matrix is able to get the maximum out of any kind of defensive system allowing a mech to capitalize on any kind of protection. The interlinking of these various protective barriers comes at the price of increased reactor pressure, a state that needs to be upkept at all times, lest the created shield matrix unravel."
  },
  {
    "id": "ms_vamp_coolant_siphon",
    "name": "\"VAMP\" COOLANT SIPHON",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": 2
      }
    ],
    "source": "IC",
    "license": "HERACLES",
    "license_level": 2,
    "effect": "If you Overcharge in the same turn you initiated a Grapple, you may force a contested Engineering Check against the character you initiated the Grapple against. All Heat resulting from the Overcharge is taken by the loser.",
    "description": "The \"Vamp\" system derives its name from the fairytales of old Cradle. Akin to a Nosferatu, a mech equipped with this system can connect its own coolant lines with those of an enemy. This is precise work, lest the user simply dump their entire coolant into their prey's chassis for little effect. Once secure connection has been established, usually following restraint of the victim, their coolant lines and reservoirs are free for the taking, ready to be burdened by any unwanted excess heat. Much to the unwilling donor's detriment. "
  },
  {
    "id": "ms_weaponsmith_1A",
    "name": "Weaponsmith Modification 1: Knockback 2",
    "type": "System",
    "sp": 0,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_indestructible"
      },
      {
        "id": "tg_exotic"
      }
    ],
    "source": "EXOTIC",
    "license_level": 0,
    "effect": "Not an actual System, just a way to keep track of Weaponsmith effects. To fill out SP you can equip the exotic \"Weaponsmith Mod\".",
    "description": ""
  },
  {
    "id": "ms_weaponsmith_1B",
    "name": "Weaponsmith Modification 1: Overkill",
    "type": "System",
    "sp": 0,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_indestructible"
      },
      {
        "id": "tg_exotic"
      }
    ],
    "source": "EXOTIC",
    "license_level": 0,
    "effect": "Not an actual System, just a way to keep track of Weaponsmith effects. To fill out SP you can equip the exotic \"Weaponsmith Mod\".",
    "description": ""
  },
  {
    "id": "ms_weaponsmith_1C",
    "name": "Weaponsmith Modification 1: Crit: Prone",
    "type": "System",
    "sp": 0,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_indestructible"
      },
      {
        "id": "tg_exotic"
      }
    ],
    "source": "EXOTIC",
    "license_level": 0,
    "effect": "Not an actual System, just a way to keep track of Weaponsmith effects. To fill out SP you can equip the exotic \"Weaponsmith Mod\".",
    "description": ""
  },
  {
    "id": "ms_weaponsmith_2A",
    "name": "Weaponsmith Modification 2: Armor Piercing",
    "type": "System",
    "sp": 0,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_indestructible"
      },
      {
        "id": "tg_exotic"
      }
    ],
    "source": "EXOTIC",
    "license_level": 0,
    "effect": "Not an actual System, just a way to keep track of Weaponsmith effects. To fill out SP you can equip the exotic \"Weaponsmith Mod\".",
    "description": ""
  },
  {
    "id": "ms_weaponsmith_2B",
    "name": "Weaponsmith Modification 2: Range/Threat Increase",
    "type": "System",
    "sp": 0,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_indestructible"
      },
      {
        "id": "tg_exotic"
      }
    ],
    "source": "EXOTIC",
    "license_level": 0,
    "effect": "Not an actual System, just a way to keep track of Weaponsmith effects. To fill out SP you can equip the exotic \"Weaponsmith Mod\".",
    "description": ""
  },
  {
    "id": "ms_weaponsmith_2C",
    "name": "Weaponsmith Modification 2: Crit: 19+",
    "type": "System",
    "sp": 0,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_indestructible"
      },
      {
        "id": "tg_exotic"
      }
    ],
    "source": "EXOTIC",
    "license_level": 0,
    "effect": "Not an actual System, just a way to keep track of Weaponsmith effects. To fill out SP you can equip the exotic \"Weaponsmith Mod\".",
    "description": ""
  },
  {
    "id": "ms_weaponsmith_3A",
    "name": "Weaponsmith Modification 3: +1 Accuracy",
    "type": "System",
    "sp": 0,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_indestructible"
      },
      {
        "id": "tg_exotic"
      }
    ],
    "source": "EXOTIC",
    "license_level": 0,
    "effect": "Not an actual System, just a way to keep track of Weaponsmith effects. To fill out SP you can equip the exotic \"Weaponsmith Mod\".",
    "description": ""
  },
  {
    "id": "ms_weaponsmith_3B",
    "name": "Weaponsmith Modification 3: Seeking",
    "type": "System",
    "sp": 0,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_indestructible"
      },
      {
        "id": "tg_exotic"
      }
    ],
    "source": "EXOTIC",
    "license_level": 0,
    "effect": "Not an actual System, just a way to keep track of Weaponsmith effects. To fill out SP you can equip the exotic \"Weaponsmith Mod\".",
    "description": ""
  },
  {
    "id": "ms_weaponsmith_3C",
    "name": "Weaponsmith Modification 3: +2 Bonus Damage",
    "type": "System",
    "sp": 0,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_indestructible"
      },
      {
        "id": "tg_exotic"
      }
    ],
    "source": "EXOTIC",
    "license_level": 0,
    "effect": "Not an actual System, just a way to keep track of Weaponsmith effects. To fill out SP you can equip the exotic \"Weaponsmith Mod\".",
    "description": ""
  },
  {
    "id": "ms_adonis_exo_plating",
    "name": "ADONIS EXO PLATING",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": 2
      }
    ],
    "source": "IC",
    "license": "HERACLES",
    "license_level": 3,
    "effect": "Spend a Charge to automatically Succeed a Check or Save or to automatically win a contested check. This occurs before any dice are rolled.",
    "description": "Representing a wholistic approach to mech design, the Adonis Expo Plating is more than a simple stop gap measure to shore up a frame's weaknesses. Powered by their own solid core batteries the plates making up the system cover the whole mech, giving it an uncanny muscular appearance, which in turn gave the system its name. During combat a mech's internals are free to draw additional power from these plates, draining them of their energy and rerouting it to critical systems whenever need arises. Thus bolstered, a mech's system become virtually unassailable for a short duration. "
  },
  {
    "id": "ms_reflex_booster",
    "name": "REFLEX BOOSTER",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "HERACLES",
    "license_level": 1,
    "actions": [
      {
        "activation": "Protocol",
        "detail": "Perform an Agility Check. On a success you clear the Prone Status."
      }
    ],
    "description": "Stabilizing gyroscopes and self-righting mechanisms can come in handy in a pinch, allowing a mech to operate at peak efficiency despite treacherous ground or malicious efforts to keep it prone."
  },
  {
    "id": "ms_system_ripper",
    "name": "SYSTEM RIPPER",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "HERACLES",
    "license_level": 1,
    "effect": "1/Round after successfully Invading a character you may roll a Systems Save against their Save target. On a success they take 1 Heat and take +1 Heat from each successful Invade made against them until the end of the current turn.",
    "description": "The System Ripper is a powerful tool that allows a frame to override a target's reactor safety protocols. Once a window like that is created the target becomes more susceptible to follow-up attacks, rapidly losing reactor integrity with each successful systems infiltration."
  },
  {
    "id": "ms_reaper_stride",
    "name": "REAPER STRIDE",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      }
    ],
    "source": "IC",
    "license": "ACASTUS",
    "license_level": 2,
    "actions": [
      {
        "activation": "Protocol",
        "detail": "You may move up to 2 Spaces towards the closest hostile in your Line of Sight."
      }
    ],
    "description": "The \"Reaper Stride\" system is a sub-class Comp/Con that tracks nearby hostiles at all times, even without a pilot's input. If engaged the Comp/Con is capable of taking control of the mech for a brief moment, able to position the mech efficiently while the pilot can concentrate on other things. This twitch movement at superhuman speeds often is a clear sign of imminent destruction for potential targets, thus coining the term \"Reaper Stride\"."
  }
]