[
  {
    "id": "t_antiquarian",
    "name": "ANTIQUARIAN",
    "description": "It's rare for a mech not to be printed, yet real enthusiasts don't let the grease, sweat and effort stop them.  Relying on esoteric, obscure, and outdated parts, these individuals really make their mech their own. Making repairs on these heavily customized machines ain't easy, but easy ain’t what pilots like this signed up for. The intimate connection they share with their mech and equipment often gives them an edge in combat, despite the condescending smiles of their fellow Lancers. ",
    "ranks": [
      {
        "name": "VINTAGE PARTS",
        "description": "Whenever you rest you may repair all Weapons on a single mount or a single System without spending Repair Points."
      },
      {
        "name": "HEIRLOOM FRAME",
        "description": "You gain access to Heirloom Dice, D3s. After rolling Structure damage but before applying any results, you may expend any amount of repair points to roll that many Heirloom dice. You may then add the result of any of those d3 to any d6 involved in the Structure roll. You may apply more than one d3 to a d6. After modifying all results you must still take the lowest one. If this increases the result of every d6 in the roll above 6 you still take Structure Damage but may ignore the outcome of the Structure roll. "
      },
      {
        "name": "Honored Relic",
        "description": "Each time you take Structure Damage your first Heirloom Die does not cost any Repair Points. "
      }
    ],
    "icon_url": "https://i.imgur.com/Fa4qAIT.png"
  },
  {
    "id": "t_bounty_hunter",
    "name": "BOUNTY HUNTER",
    "description": "Gabriel Ramirez takes his job seriously. He's prepared, he has studied the specs of his quarry’s frame. He is aware of the defective exhaust cover. He knows how to exploit that flaw. He's a professional and if successful, paid accordingly. No one escapes him and, by extension, his clients.",
    "ranks": [
      {
        "name": "CONTRACT",
        "description": "1/Scene as a Free Action you may designate a hostile non-Eidolon, non-Shard character within Line of Sight to be your Bounty for the rest of the Scene. You gain +1 Accuracy on all attacks against your Bounty as well as on Saves forced by them."
      },
      {
        "name": "HOT PURSUIT",
        "description": "Gain the \"Hot Pursuit\" Reaction.",
        "actions": [
          {
            "name": "Hot Pursuit",
            "activation": "Reaction",
            "frequency": "1/Round",
            "trigger": "Your Bounty moves.",
            "detail": "After the movement is resolved, you may immediately Boost towards your Bounty. If that brings you adjacent to your Bounty they are knocked Prone."
          }
        ]
      },
      {
        "name": "PROFESSIONALISM",
        "description": "Damage you inflict against your Bounty can not be reduced in any way."
      }
    ],
    "icon_url": "https://i.imgur.com/fcuzLUe.png"
  },
  {
    "id": "t_corpse_collector",
    "name": "CORPSE COLLECTOR",
    "description": "Kara was forced to grow up on a battlefield. While being part of the resistance was never easy, the skills she would acquire would prove to be invaluable. Having learned from a young age to conceal herself between the wrecks of abandoned war machines she later used the same skills when it came to fighting the Baron's forces. With her cobbled together mech she soon became a focal point for the whole movement. \"Reaper\", her mech, became festooned with pieces from countless adversaries over the course of years. Protection, trophies, reminders.",
    "ranks": [
      {
        "name": "OBITUARY",
        "description": "As a Quick Action you may detonate a single Wrecked Mech adjacent to you, destroying it. Characters other than you adjacent to the wreckage take 4 AP Explosive damage."
      },
      {
        "name": "GHOUL",
        "description": "Whenever you end your turn adjacent to a wrecked mech you become Invisible until the start of your next turn, until you take damage, lose adjacency, take a reaction or force a save. "
      },
      {
        "name": "GRAVE ROBBER",
        "description": "Whenever you use Obituary you may gain +1 Armor for the rest of the scene. (Up to the usual maximum of 4)."
      }
    ],
    "icon_url": "https://i.imgur.com/tgwMUqQ.png"
  },
  {
    "id": "t_reactor_criminal",
    "name": "REACTOR CRIMINAL",
    "description": "You have a love-hate relationship with your reactor. The power contained in it is just one button press away. And it's your reactor, right? You can do with it as you damn well please. What do these nerds with their degrees know... look at them with their \"recommended parameters\" and \"safety margins\". You didn't want this reactor anyway. You didn't ask for it. Get it out. You're tired of it... is it me or is it getting hotter in here?",
    "ranks": [
      {
        "name": "MELTDOWN CROOK",
        "description": "Whenever you Self Destruct you may set your reactor to melt down at the end of the current turn."
      },
      {
        "name": "COOLANT GANGSTER",
        "description": "Whenever you Overcharge all your Weapons gain Overkill until the end of your turn."
      },
      {
        "name": "NUCLEAR KINGPIN",
        "description": "Gain a Nuclear Die, a d3, starting at 3. Whenever you Overcharge you may decrease its value by one. When you Overcharge while the die is at 1 you may vent your reactor in a Cone 5 Explosion, resetting the die to 3. If you do, you may also clear Exposed and become Immune to Exposed for the rest of your turn. Characters in the Cone must pass an Engineering save or take Heat and Burn equal to the amount of Heat your mech took as a result of the Overcharge (after mitigating effects such as Resistance). On a successful save they take both half Heat and Burn. <br>The Nuclear Die persists between scenes but resets on a rest or whenever you clear any amount of Heat by any means other than taking Stress damage."
      }
    ],
    "icon_url": "https://i.imgur.com/GSTc4cT.png"
  },
  {
    "id": "t_weaponsmith",
    "name": "WEAPONSMITH",
    "description": "For most Lancers, the weapons they wield in battle are their bread and butter. Some individuals go a step farther, becoming virtually obsessed with modifying, improving and upgrading the tools of their trade. From simple modifications such as a thermal scope or extended haft to extensive rerouting of power lines and munition feeds. Often this tinkering culminates in Smartcore integration sooner or later, resulting in a truly intelligent weapon that practically wields itself.",
    "ranks": [
      {
        "name": "BASELINE MODIFICATION",
        "description": "You gain a special Mod system that costs 1 SP and which may be applied to any weapon just like a regular mod. Whenever you perform a Full Repair you may select one of the following bonuses that the mod applies to any weapon it is attached to: <br>• Knockback 2 <br>• Overkill <br>• On Crit: Target becomes Prone <br>You can add Weaponsmith bonuses via Exotic Equipment during mech creation."
      },
      {
        "name": "EXPERT CALIBRATION",
        "description": "The Mod's SP cost increases by 1 <br>Pick an additional Bonus: <br>• Armor-Piercing <br>• +3 Range (Ranged Weapons Only) /  +1 Threat (Melee Weapons Only) <br>• This weapon's attacks are considered critical hits on a 19+ <br>You can add Weaponsmith bonuses via Exotic Equipment during mech creation."
      },
      {
        "name": "SMARTCORE INTEGRATION",
        "description": "The Mod's SP cost increases by 1.<br>Pick an additional Bonus: <br>• +1 Accuracy <br>• Seeking <br>• +2 Bonus Damage<br>You can add Weaponsmith bonuses via Exotic Equipment during mech creation."
      }
    ],
    "icon_url": "https://i.imgur.com/Ox5xqbb.png"
  }
]